[
  {
    "id": "1",
    "title": "Player Unknowns Battle Ground: PUBG",
    "coverPhoto": "https://i.ibb.co.com/YFntJXZY/pubg.png",
    "category": "FPS",
    "downloadLink": "https://www.pubgmobile.com/en-US/home.shtml",
    "description": "PUBG Mobile is an intense battle royale game where up to 100 players parachute onto an island, scavenge weapons, and fight to be the last one standing. It blends tactical survival with realistic gunplay and a variety of dynamic environments. Whether solo or with friends, every match feels unpredictable and thrilling.",
    "ratings": "4.5",
    "developer": "Krafton"
  },
  {
    "id": "2",
    "title": "Call of Duty: Mobile",
    "coverPhoto": "https://i.ibb.co.com/CsSXpXrt/App-Icon-CODM-Global.webp",
    "category": "FPS",
    "downloadLink": "https://www.callofduty.com/mobile",
    "description": "Call of Duty: Mobile delivers a high-quality shooter experience with fan-favorite maps, weapons, and characters from across the franchise. Players can engage in fast-paced multiplayer matches, thrilling battle royale modes, and ranked competitions. It’s a complete COD experience optimized for mobile gameplay.",
    "ratings": "4.6",
    "developer": "Activision"
  },
  {
    "id": "3",
    "title": "Garena Free Fire",
    "coverPhoto": "https://i.ibb.co.com/nqN6YNYh/freefire.png",
    "category": "Battle Royale",
    "downloadLink": "https://ff.garena.com/",
    "description": "Garena Free Fire offers quick 10-minute survival matches where 50 players drop into a remote island and fight to stay alive. Its shorter sessions, diverse characters, and unique skill system make it perfect for mobile players. The game also features regular events and themed updates that keep gameplay fresh and exciting.",
    "ratings": "4.2",
    "developer": "Garena"
  },
  {
    "id": "4",
    "title": "Clash of Clans",
    "coverPhoto": "https://i.ibb.co.com/tM9Bz06P/coc.png",
    "category": "Strategy",
    "downloadLink": "https://supercell.com/en/games/clashofclans/",
    "description": "Clash of Clans lets you build your village, train troops, and wage epic clan wars against millions of players worldwide. Strategic planning, resource management, and teamwork are key to dominating the battlefield. With new heroes and updates, the game continues to evolve with endless possibilities for builders and warriors alike.",
    "ratings": "4.7",
    "developer": "Supercell"
  },
  {
    "id": "5",
    "title": "Among Us",
    "coverPhoto": "https://i.ibb.co.com/FbYWNfJC/amongus.webp",
    "category": "Social Deduction",
    "downloadLink": "https://innersloth.com/gameAmongUs.php",
    "description": "Among Us challenges players to work together aboard a spaceship while impostors secretly sabotage their mission. Communication, deception, and quick thinking define the experience. Its simple mechanics and hilarious interactions make it a timeless hit for groups and streamers alike.",
    "ratings": "4.3",
    "developer": "Innersloth"
  },
  {
    "id": "6",
    "title": "Genshin Impact",
    "coverPhoto": "https://i.ibb.co.com/mrz1J5Bq/genshin-impact4958.jpg",
    "category": "RPG",
    "downloadLink": "https://genshin.hoyoverse.com/en/",
    "description": "Genshin Impact is an open-world action RPG that immerses players in the breathtaking world of Teyvat. With its elemental combat system, diverse characters, and beautiful landscapes, the game rewards exploration and discovery. Frequent updates bring new regions, stories, and heroes to uncover.",
    "ratings": "4.6",
    "developer": "HoYoverse"
  },
  {
    "id": "7",
    "title": "Minecraft",
    "coverPhoto": "https://i.ibb.co.com/Wpkskgks/minecraft.webp",
    "category": "Sandbox",
    "downloadLink": "https://www.minecraft.net/en-us",
    "description": "Minecraft invites players into a limitless world made of blocks where they can build, explore, and survive. Whether in creative mode or surviving against monsters in survival mode, every world is unique. Its endless creativity and community-driven content have made it one of the most beloved games of all time.",
    "ratings": "4.8",
    "developer": "Mojang Studios"
  },
  {
    "id": "8",
    "title": "Fortnite",
    "coverPhoto": "https://i.ibb.co.com/Z65jvXbt/fortnite-ef86-1200.webp",
    "category": "Battle Royale",
    "downloadLink": "https://www.epicgames.com/fortnite/en-US/home",
    "description": "Fortnite blends fast-paced battle royale combat with creative building mechanics and vibrant visuals. Players can fight solo or in squads, construct defenses, and take part in seasonal events that reshape the game’s world. Its ever-changing gameplay keeps players coming back season after season.",
    "ratings": "4.4",
    "developer": "Epic Games"
  },
  {
    "id": "9",
    "title": "Valorant",
    "coverPhoto": "https://i.ibb.co.com/rRQVzwRJ/valorant.jpg",
    "category": "FPS",
    "downloadLink": "https://playvalorant.com/",
    "description": "Valorant combines tactical shooting with unique character abilities to create deep, competitive gameplay. Each agent offers a different playstyle, encouraging strategy and teamwork. Its precision gunplay and global esports scene make it a favorite among competitive players.",
    "ratings": "4.6",
    "developer": "Riot Games"
  },
  {
    "id": "10",
    "title": "League of Legends: Wild Rift",
    "coverPhoto": "https://i.ibb.co.com/Wps0yFZ4/leagueoflegends.png",
    "category": "MOBA",
    "downloadLink": "https://wildrift.leagueoflegends.com/",
    "description": "Wild Rift brings the iconic League of Legends experience to mobile with streamlined controls and faster matches. Players engage in 5v5 team battles, mastering champions and strategic teamwork. The game captures the depth of LoL while being perfectly optimized for handheld play.",
    "ratings": "4.4",
    "developer": "Riot Games"
  },
  {
    "id": "11",
    "title": "Apex Legends Mobile",
    "coverPhoto": "https://i.ibb.co.com/67m7sZPt/apex-legends-mobile-logo-png-seeklogo-503898.png",
    "category": "Battle Royale",
    "downloadLink": "https://www.ea.com/games/apex-legends",
    "description": "Apex Legends Mobile delivers fast-paced, squad-based battle royale action featuring unique Legends with distinct abilities. Team coordination and movement are key to victory in every match. It’s a visually polished, adrenaline-fueled shooter that rewards skill and teamwork.",
    "ratings": "4.3",
    "developer": "Electronic Arts"
  },
  {
    "id": "12",
    "title": "Subway Surfers",
    "coverPhoto": "https://i.ibb.co.com/pj9Fb8pc/subway.png",
    "category": "Arcade",
    "downloadLink": "https://sybogames.com/games/subway-surfers/",
    "description": "Subway Surfers is a vibrant endless runner where players dash through colorful cities, dodging trains and obstacles. Smooth controls and regular location-themed updates keep gameplay exciting. Its charming art style and simple mechanics make it a timeless mobile classic.",
    "ratings": "4.5",
    "developer": "SYBO Games"
  },
  {
    "id": "13",
    "title": "Candy Crush Saga",
    "coverPhoto": "https://i.ibb.co.com/YB5HXJYz/1200px-Candy-Crush-Saga-Logo.jpg",
    "category": "Puzzle",
    "downloadLink": "https://king.com/game/candycrush",
    "description": "Candy Crush Saga is a colorful puzzle adventure where players match candies to progress through hundreds of challenging levels. Simple to play yet hard to master, it’s perfect for quick sessions or long play. Frequent events and boosters keep the gameplay fresh and rewarding.",
    "ratings": "4.6",
    "developer": "King"
  },
  {
    "id": "14",
    "title": "Asphalt 9: Legends",
    "coverPhoto": "https://i.ibb.co.com/8DS2PT4V/asphlt.webp",
    "category": "Racing",
    "downloadLink": "https://asphaltlegends.com/",
    "description": "Asphalt 9: Legends puts players behind the wheel of real-world supercars across visually stunning tracks. With smooth controls, nitro boosts, and cinematic action, every race feels like a movie. Unlock cars, upgrade them, and race your way through single-player and multiplayer challenges.",
    "ratings": "4.4",
    "developer": "Gameloft"
  },
  {
    "id": "15",
    "title": "Mobile Legends: Bang Bang",
    "coverPhoto": "https://i.ibb.co.com/nJJBRBH/mobile-legends-new-logo-png-seeklogo-599669.png",
    "category": "MOBA",
    "downloadLink": "https://m.mobilelegends.com/",
    "description": "Mobile Legends: Bang Bang is a fast-paced 5v5 MOBA featuring short matches and intuitive controls. Players choose from a wide range of heroes and work together to destroy the enemy base. Frequent updates, events, and tournaments keep the competitive scene vibrant and engaging.",
    "ratings": "4.3",
    "developer": "Moonton"
  },
  {
    "id": "16",
    "title": "Roblox",
    "coverPhoto": "https://i.ibb.co.com/4nmMq7RG/roblox-logo-png-seeklogo-365972.png",
    "category": "Sandbox",
    "downloadLink": "https://www.roblox.com/",
    "description": "Roblox is a massive online platform that lets players create, share, and explore millions of user-generated worlds. From adventure games to simulations, there’s something for everyone. Its blend of creativity, social interaction, and imagination fuels a thriving global community.",
    "ratings": "4.5",
    "developer": "Roblox Corporation"
  },
  {
    "id": "17",
    "title": "Temple Run 2",
    "coverPhoto": "https://i.ibb.co.com/nqPxFLWP/templerun2.jpg",
    "category": "Arcade",
    "downloadLink": "https://imangistudios.com/games/temple-run-2/",
    "description": "Temple Run 2 continues the endless running adventure with improved visuals, new obstacles, and smoother gameplay. Players sprint through cliffs, zip lines, and mines while avoiding dangerous traps. Its addictive nature makes it one of the most iconic mobile games ever.",
    "ratings": "4.3",
    "developer": "Imangi Studios"
  },
  {
    "id": "18",
    "title": "Shadow Fight 4: Arena",
    "coverPhoto": "https://i.ibb.co.com/7xX15npm/shaowfight4.jpg",
    "category": "Fighting",
    "downloadLink": "https://nekki.com/games/shadow-fight-arena/",
    "description": "Shadow Fight 4: Arena offers fast, skill-based PvP duels featuring beautifully animated fighters. Each character has unique shadow abilities that make every battle strategic and cinematic. Its deep combat mechanics and stunning visuals make it a standout mobile fighting game.",
    "ratings": "4.4",
    "developer": "Nekki"
  },
  {
    "id": "19",
    "title": "Pokemon GO",
    "coverPhoto": "https://i.ibb.co.com/wFgTSgq0/pokemon-go-logo-png-seeklogo-286439.png",
    "category": "Adventure",
    "downloadLink": "https://pokemongolive.com/",
    "description": "Pokemon GO encourages players to explore the real world while capturing Pokémon using augmented reality and GPS technology. It combines outdoor exploration with collecting, trading, and battling Pokémon. Frequent events and updates keep the experience fresh and engaging for all trainers.",
    "ratings": "4.2",
    "developer": "Niantic"
  },
  {
    "id": "20",
    "title": "Clash Royale",
    "coverPhoto": "https://i.ibb.co.com/RkG2qMGd/Clash-Royale-App-Icon.webp",
    "category": "Strategy",
    "downloadLink": "https://supercell.com/en/games/clashroyale/",
    "description": "Clash Royale is a fast-paced real-time strategy game where players collect cards and deploy troops in head-to-head battles. Combining tower defense and card strategy, it rewards smart timing and tactical thinking. Constant balance updates and tournaments keep it fresh for casual and competitive players alike.",
    "ratings": "4.5",
    "developer": "Supercell"
  }
]
